public/programming/notes/algoritmi/03-greedy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="algoritmi.html">Algoritmi</a> &gt;
</p>

<div id="outline-container-org24f329b" class="outline-2">
<h2 id="org24f329b">Greedy</h2>
<div class="outline-text-2" id="text-org24f329b">
<p>
La tecnica greedy può essere utilizzata se fra le molte scelte
possibili, ne può essere facilmente individuata una che porta
sicuramente alla soluzione ottima.  Inoltre il problema deve avere
sottostruttura ottima: fatta tale scelta, resta un sottoproblema con
la stessa struttura del problema principale.
</p>

<p>
L'approccio greedy si riassume in:
</p>

<ul class="org-ul">
<li>Evidenziare i "passi di decisione" trasformando il problema di
ottimizzazione in un problema di scelte sucecssive.</li>
<li>Evidenziare una possibile scelta ingorda dimostrandola rispetto al
"principio della scelta ingorda".</li>
<li>Evidenziare la sottostruttura ottima dimostrando che la soluzione
ottima del problema "residuo" dopo la scelta ingorda può essere
unito a tale scelta.</li>
<li>Scrittura codice: top-down, anche in maniera iterativa e con
possibile pre-processing dell'input.</li>
</ul>
</div>

<div id="outline-container-orgc49d337" class="outline-3">
<h3 id="orgc49d337">Insieme indipendente di intervalli</h3>
<div class="outline-text-3" id="text-orgc49d337">
<p>
Sia \(S=\{ 1, 2, .., n \}\) un insieme di intervalli della retta
reale. Ogni intervallo \([a_i, b_i)\), con \(i\in S\), e' chiuso a
sinistra e aperto a destra con \(a_i\) tempo di inizio e \(b_i\) tempo di
fine. Un insieme indipendente massimale e' un <b><b>sottoinsieme di
massima cardinalità</b></b> formato da intervalli tutti disgiunti tra loro.
</p>

<p>
Possiamo risolvere questo problema con la programmazione dinamica,
oppure possiamo dimostrare che esiste una scelta ingorda che porta
alla soluzione ottima. Vediamo entrambi gli approcci
</p>
</div>

<div id="outline-container-org4524aeb" class="outline-4">
<h4 id="org4524aeb">Soluzione con Programmazione Dinamica</h4>
<div class="outline-text-4" id="text-org4524aeb">
<p>
Si assuma che gli intervalli siano ordinati per tempo di
fine. Definiamo il sottoproblema\(S[i..j]\) come l'insieme di
intervalli che iniziano dopo la fine di \(i\) e finiscono prima
dell'inizio di \(j\):
</p>

<p>
\[S[i..j] = \{ k | b_i \le a_k < b_k \le a_j \}\]
</p>

<p>
Aggiungiamo due intervalli fittizi:
</p>

<ul class="org-ul">
<li>intervallo \(0: b_i = -\inf\):</li>
<li>intervallo \(n+1: a_{n+1}=+\inf\)</li>
</ul>

<p>
Allora il problema iniziale corrisponde al problema
\(S[0,n+1]\). Supponiamo che \(A[i..j]\) sia una soluzione ottimale di
\(S[i..j]\) e sia \(k\) un intervallo che appartiene a \(A[i..j]\); allora:
</p>

<ul class="org-ul">
<li>Il problema \(S[i..j]\) viene suddiviso in due sottoproblemi \(S[i..k]\)
e \(S[k..j]\).</li>
<li>\(A[i..j]\) contiene le soluzioni ottimali di \(S[i..k]\) e \(S[k..j]\).</li>
</ul>

<p>
Questo si dimostra utilizzando il metodo cut-and-paste.
</p>

<p>
\[DP[i][j] =
\begin{cases}
0 & S[i..j]=\emptyset \\
max_{k\in S[i..j]}(DP[i][k]+DP[k][j]+1) & altrimenti
\end{cases}\]
</p>

<p>
Complessità \(O(n^3)\). Un'alternativa potrebbe essere utilizzare la
soluzione \(O(nlogn)\) già vista nel caso di intervalli pesati, ponendo
il peso a 1.
</p>
</div>
</div>

<div id="outline-container-org49dfdd2" class="outline-4">
<h4 id="org49dfdd2">Soluzione Greedy</h4>
<div class="outline-text-4" id="text-org49dfdd2">
<p>
Teorema: Sia \(S[i..j]\) un sottoproblema non vuoto, e \(m\) l'intervallo
di \(S[i..j]\) con <b><b>minor tempo di fine</b></b>, allora:
</p>

<ul class="org-ul">
<li>il sottoproblema \(S[i..m]\) e' vuoto</li>
<li>\(m\) e' compreso in qualche soluzione ottima di \(S[i..j]\)</li>
</ul>

<p>
Dimostrazione: Vale:
</p>

<ul class="org-ul">
<li>per definizione di intervallo: \(a_m < b_m\)</li>
<li>dato che \(m\) ha minor tempo di fine: \(\forall k\in S[i..j]: b_m \le
  b_k\)</li>
<li>dalle precedenti, per transitività' vale anche: \(\forall k\in
  S[i..j]: a_m < b_k\)</li>
</ul>

<p>
Se nessun intervallo in \(S[i..j]\) termina prima di \(a_m\) allora
\(S[i..m] = \emptyset\). Sia \(A'[i..j]\) una soluzione ottima di
\(S[i..j]\). Sia \(m'\) l'intervallo con minor tempo di fine in
\(A'[i..j]\). Sia \(A[i..j]=(A'[i..j]-\{ m' \})\cup \{ m \}\) una nuova
soluzione ottenuta togliendo \(m'\) e aggiungendo \(m\) ad
\(A'[i..j]\). Allora \(A[i..j]\) e' una soluzione ottima che contiene \(m\),
in quanto ha la stessa dimensione di \(A'[i..j]\) e gli intervalli sono
indipendenti.
</p>

<p>
Posso fare una scelta ingorda selezionando l'attivita' \(m\) con il
minor tempo di fine.
</p>

<pre class="example">
Set independentSet(int[] a, int[] b)
  {ordina a e b in modo che b[1] &lt;= b[2] &lt;= .. &lt;= b[n]}
  Set S = Set()
  S.insert(1)
  int last = 1
  for i=2 to n do
    if a[i]&gt;=b[last] then
      S.insert(i)
      last = i
  return S
</pre>

<p>
Costo \(O(nlogn)\) se l'input non e' ordinato, altrimenti \(O(n)\).
</p>
</div>
</div>
</div>

<div id="outline-container-org737bce8" class="outline-3">
<h3 id="org737bce8">Resto</h3>
<div class="outline-text-3" id="text-org737bce8">
<p>
Dato un'insieme di "tagli" di monete memorizzati in un vettore di
interi positivi \(t[1..n]\) e un intero \(R\) rappresentante il resto che
dobbiamo restituire. Trovare il più piccolo numero intero di pezzi
necessari per dare un resto di \(R\) centesimi utilizzando i tagli
disponibili, assumendo di avere un numero illimitato di monete per
ogni taglio. Formalmente, trovare un vettore \(x\) di interi non
negativi tale che \(R=\sum_{i=1}^n x[i]t[i]\) e \(m=\sum_{i=1}^nx[i]\) ha
valore minimo.
</p>

<p>
Risolviamo prima il problema con la programmazione dinamica.
Sottostruttura ottima: Sia \(S(i)\) il problema di dare un resto pari ad
\(i\). Sia \(A(i)\) una soluzione ottima del problema \(S(i)\),
rappresentata da un multi-insieme; sia \(j\in A(i)\). Allora,
\(S(i-t[j])\) e' un sottoproblema di \(S(i)\), la cui soluzione ottima e'
data da \(A(i)-\{ j \}\).
</p>

<p>
\[DP[i]= \begin{cases} 0 & i=0 \\
min_{j\in R\ and\ t[j]<i}(DP[i-t[j]])+1 & altrimenti
\end{cases}\]
</p>

<p>
Complessità \(O(nR)\).
</p>

<p>
Proviamo ora a dimostrare una soluzione ingorda. Deve essere
dimostrata per ogni scelta di monete, prendiamo come esempio \(t=[50,
10, 5, 1]\).
</p>

<p>
Sia \(x\) una qualunque soluzione ottima, quindi \(R=\sum_{i=1}^n
x[i]t[i]\) e \(m=\sum_{i=1}^nx[i]\) ha valore minimo. Sappiamo che
\(t[k]x[k] < t[k-1]\), altrimenti basterebbe sostituire un certo numero
di monete di taglia \(t[k]\) con quelle del taglio \(t[k-1]\).
</p>

<ul class="org-ul">
<li>\(t[2]x[2] = 10x[2] < t[1]=50 \rightarrow x[2] < 5\)</li>
<li>\(t[3]x[3]=5x[3]<t[2]=10\rightarrow x[3]<2\)</li>
<li>\(t[4]x[4]=1x[4]<t[3]=5\rightarrow x[4]<5\)</li>
</ul>

<p>
Sia \(m_k\) la somma delle monete di taglio inferiore a \(t[k]\): \(m_k =
\sum_{i=k+1}^4x[i]t[i]\). Se dimostriamo che \(\forall k: m_k < t[k]\),
allora la soluzione (ottima) e' proprio quella calcolata
dall'algoritmo.
</p>

<ul class="org-ul">
<li>\(m_4 = 0 < 1 = t[4]\)</li>
<li>\(m_3 = x[4]*1 + m_4 \le 4*1+m_4 < 4+1 = 5 = t[3]\)</li>
<li>\(m_2 = x[3]*5+m_3 \le 1*5+m_3 < 5+5 = 10 = t[2]\)</li>
<li>\(m_1 = x[2]*10+m_2 \le 4*10+m_2 < 40+10 = 50 = t[1]\)</li>
</ul>
</div>
</div>

<div id="outline-container-org575a512" class="outline-3">
<h3 id="org575a512">Scheduling</h3>
<div class="outline-text-3" id="text-org575a512">
<p>
Supponiamo di avere un processore e \(n\) job da eseguire su di esso,
ognuno caratterizzato da un tempo di esecuzione \(t[i]\) noto a
priori. Trovare una sequenza di esecuzione che minimizzi il tempo di
completamento medio definito come \(\frac{1}{n}\sum_{j=0}^n
\sum_{i=1}^jt[A[i]]\) dove il vettore \(A[1..n]\) contiene una
permutazione di \(\{ 1, ..., n \}\).
</p>

<p>
Teorema: Scelta greedy: esiste una soluzione ottima \(A\) in cui il job
con minor tempo di fine \(m\) si trova in prima posizione (\(A[1]=m\)).
Teorema: sottostruttura ottima: Sia \(A\) una soluzione ottima di un
problema con \(n\) job, in cui il job con minor tempo di fine \(m\) si
trova in prima posizione. La permutazione dei seguenti \(n-1\) job in
\(A\) e' una soluzione ottima al sottoproblema in cui il job \(m\) non
viene considerato.
</p>

<p>
Dimostrazione: Si consideri una permutazione ottima \(A\), sia \(m\) la
posizione in \(A\) in cui si trova il job con minor tempo di fine. Si
consideri una permutazione \(A'\) in cui il jon in posizione 1, \(m\)
vengono scambiati. Il tempo di completamento medio di \(A'\) e' minore o
uguale al tempo di completamento medio di \(A\). Poiche' \(A\) e; ottima,
\(A'\) non puo' avere tempo di completamento minore e quindi anche \(A'\)
e' ottima.
</p>
</div>
</div>

<div id="outline-container-orgf147118" class="outline-3">
<h3 id="orgf147118">Zaino frazionario</h3>
<div class="outline-text-3" id="text-orgf147118">
<p>
Dati un'intero positivo \(C\) che rappresenta la capacita' dello zaino,
e \(n\) oggetti ognuno con un profitto \(p\) e un peso \(w\) in
\(\mathbb{Z^+}\).
</p>

<p>
Zaino 0/1: Trovare un sottoinsieme \(S\) di \(\{ 1, ..., n \}\) di oggetti
tale che il loro peso totale non superi la capacita' massima e il loro
profitto totale sia massimo.
</p>

<p>
Zaino reale (o frazionario): e' possibile prendere frazioni di
oggetti.
</p>

<p>
Scelta ingorda: Si possono ordinare gli oggetti per il rapporto
profitto su peso e prenderli in questo ordine, se vi e' abbastanza
capacita'.
</p>
</div>
</div>

<div id="outline-container-org5312ad3" class="outline-3">
<h3 id="org5312ad3">Compressione di Huffman</h3>
<div class="outline-text-3" id="text-org5312ad3">
<p>
In un codice a prefisso, <b><b>nessun codice e' prefisso di un altro
codice</b></b>. Ad esempio con \(a\rightarrow 0,\ b\rightarrow 10,\
c\rightarrow 11\) possiamo codificare \(ababca\) con \(100100110\).
</p>

<p>
L'algoritmo di Huffman e' ottimo per costruire codici prefissi.
</p>

<p>
L'algoritmo di decodifica può essere visto come l'attraversamento di
un albero binario, ed e' il seguente:
</p>

<pre class="example">
parti dalla radice
while file non e' finito do
  leggi un bit
  if bit e' zero then
    vai a sinistra
  else
    vai a destra
  if nodo foglia then
    stampa il carattere
    torna alla radice
</pre>

<p>
Dato un file \(F\) composto da caratteri nell'alfabeto \(\sum\). Vogliamo
minimizzare la lunghezza dei caratteri che compaiono più
frequentemente.
</p>

<p>
Possiamo procedere nel seguente modo:
</p>

<ul class="org-ul">
<li>costruiamo un nodo foglia per ogni carattere, etichettato con la
propria frequenza</li>
<li>rimuoviamo i due nodi con frequenza minore \(f_x, f_y\)</li>
<li>creiamo un nodo con etichetta "-" e frequenza \(f_x+f_y\)</li>
<li>colleghiamo i due nodi rimossi con il nuovo nodo</li>
<li>aggiungiamo il nodo cosi' creato all'insieme</li>
<li>si termina quanto resta un solo nodo sul primo livello</li>
<li>al termine, si etichettano gli archi dell'albero con un bit \(0,1\).</li>
</ul>

<p>
Algoritmo:
</p>

<pre class="example">
Tree hiffman(int[] c, int[] f, int n)
  PriorityQueue Q = MinPriorityQueue()
  for i=1 to n do
    Q.insert(Tree(c[i], f[i]), f[i])
  for i=1 to n-1 do
    z1 = Q.deleteMin()
    z2 = Q.deleteMin()
    z = Tree(nil, z1.freq + z2.freq)
    z.left = z1
    z.right = z2
    Q.insert(z, z.freq)
  return Q.deleteMin()	
</pre>

<p>
La dimostrazione non viene qui riportata. Intuitivamente, si assume di
prendere i due caratteri con frequenza più bassa \(x\) e \(y\) e si
dimostra che esiste un prefisso ottimo dove i due caratteri hanno la
stessa profondità massima e i loro codici differiscono solo per
l'ultimo bit. Per dimostrare ciò si suppone di avere un codice ottimo
e, scambiando i due caratteri, abbiamo ancora una soluzione ottima.
</p>
</div>
</div>

<div id="outline-container-org78a7467" class="outline-3">
<h3 id="org78a7467">Alberi di copertura di peso minimo</h3>
<div class="outline-text-3" id="text-org78a7467">
<p>
Dato un grafo pesato, determinare come interconnettere tutti i suoi
nodi minimizzando il costo del peso associato ai suoi archi.
</p>
</div>

<div id="outline-container-org469f8a3" class="outline-4">
<h4 id="org469f8a3">Algoritmo Generico</h4>
<div class="outline-text-4" id="text-org469f8a3">
<p>
Definizioni:
</p>

<ul class="org-ul">
<li>Un arco (u, v) è detto <b><b>sicuro</b></b> per A se \(A \cup {(u, v)}\) è
ancora un sottoinsieme di qualche albero di connessione minimo</li>
<li>Un <b><b>taglio</b></b> di un grafo non orientato e' una partizione dei suoi
nodi in due sottoinsiemi disgiunti.</li>
<li>Un arco che attraversa un taglio e' detto <b><b>leggero</b></b> se il suo peso
e' minimo fra i pesi degli archi che attraversano il taglio.</li>
</ul>

<p>
Teorema: Sia \(G=(V,E)\) un grafo non orientato e connesso. Sia \(w:
V\times V\rightarrow \mathbb{R}\). Sia \(A\subseteq E\) un sottoinsieme
contenuto in un qualche albero di copertura minimo per \(G\), sia \((S,
V-S)\) un qualunque taglio che rispetta \(A\). Sia \((u, v)\) un arco
leggero che attraversa il taglio. Allora l'arco \((u, v)\) e' sicuro per
\(A\).
</p>

<p>
Dimostrazione:
Sia T un albero di copertura minimo che contiene A. Esistono due casi
</p>

<ul class="org-ul">
<li>\((u, v) \in T\), allora \((u, v)\) e' sicuro per A</li>
<li>\((u, v)\notin T\): trasformiamo T in un albero T' contenente \((u, v)\)
e dimostriamo che T' e' un albero di copertura minimo.</li>
</ul>

<p>
Se (u, v) non appartengono a T, allora ci deve essere un arco \((x, y)\)
che appartiene e chiude il taglio. Allora rimuovo \((x, y)\) e aggiungo
\((u, v)\) e lo chiamo \(T'\). Per definizione, \((u, v)\) e' un arco
leggero (e' il minimo tra tutti gli archi tra i due tagli), allora
\(T'\) e' minimo.
</p>
</div>
</div>

<div id="outline-container-org0d6e8d7" class="outline-4">
<h4 id="org0d6e8d7">Algoritmo di Kruskal</h4>
<div class="outline-text-4" id="text-org0d6e8d7">
<p>
Ordiniamo gli alberi in modo crescente. Ogni volta, aggiungo alla
foresta l'arco di peso minimo fino ad avere n-1 archi, evitando cicli.
NOTA: Uso MFSET.
</p>

<pre class="example">
Set kruskal(Edge[] A, int n, int m)
  Set T = Set()
  Mfset M = Mfset(n)
  % ordina A per peso
  int count = 0
  int i=1
  % Termina quando l'albero ha n-1 archi
  % o non ci sono piu' archi
  while count &lt; n-1 and i &lt;= m do
    if M.find(A[i].i) != M.find(A[i].v) then
      M.merge(A[i].w, A[i].v)
      T.insert(A[i])
      count = count + 1
    i = i + 1
  return T
</pre>

<p>
gist: itero su n-1 archi in ordine. Li aggiungo alla soluzione se
connettono due componenti sconnesse tra di loro.
</p>

<p>
Tempo computazionale: \(O(mlogn)\)
</p>
</div>
</div>

<div id="outline-container-org9c7bf7c" class="outline-4">
<h4 id="org9c7bf7c">Algoritmo di Primm</h4>
<div class="outline-text-4" id="text-org9c7bf7c">
<p>
L'algoritmo di Prim procede mantenendo in \(A\) un singolo albero la cui
frontiera cresce fino a quando non ricopre tutti i vertici.
</p>

<ul class="org-ul">
<li>parto da un nodo a caso e prendo il minimo tra tutti gli edges nella
frontiera senza fare cicli (sono tutti gli archi che posso
attraversare da qualsiasi nodo nella mia componente). Continuo
avanti finché non ho collegato tutti i nodi.</li>
</ul>

<p>
Uno una coda di priorità. Tempo \(O(mlogn)\)
</p>

<hr />

<p>
Travel: <a href="algoritmi.html">Algoritmi</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
